360-Geelib-Copilot-Code.geelibcopilotcode
aaron-bond.better-comments
adam-bender.commit-message-editor
adpyke.codesnap
albert.TabOut
alefragnani.Bookmarks
alefragnani.project-manager
alfredbirk.tailwind-documentation
Alibaba-Cloud.tongyi-lingma
aminer.codegeex
antfu.browse-lite
antfu.goto-alias
antfu.iconify
antfu.unocss
antfu.vite
astro-build.astro-vscode
augment.vscode-augment
BaiduComate.comate
BeilunYang.cursor-rules
bierner.emojisense
biomejs.biome
bradlc.vscode-tailwindcss
cake-build.cake-vscode
ChakrounAnas.turbo-console-log
charliermarsh.ruff
christian-kohler.path-intellisense
cipchk.cssrem
cloudstudio.live-server
cnbcool.cnb-welcome
Codeium.codeium
colourafredi.vscode-deepseek
Continue.continue
cweijan.vscode-office
Dart-Code.dart-code
Dart-Code.flutter
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
developer2006.svg-gallery
DEVSENSE.composer-php-vscode
dexxiez.shadcn-color-preview
docsmsft.docs-markdown
docsmsft.docs-preview
DominicVonk.parameter-hints
DotJoshJohnson.xml
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
Dwtexe.cursor-stats
eamodio.gitlens
EditorConfig.EditorConfig
Equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
figma.figma-vscode-extension
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.code-runner
foxundermoon.shell-format
gep13.chocolatey-vscode
gera2ld.markmap-vscode
GeriYoco.vscode-image-gallery
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
github.github-vscode-theme
GitHub.remotehub
GitHub.vscode-github-actions
GitHub.vscode-pull-request-github
golang.Go
golang.go-nightly
Google.geminicodeassist
GoogleCloudTools.cloudcode
GraphQL.vscode-graphql-syntax
Gruntfuggly.todo-tree
GuodongSun.vscode-git-cruise
HashiCorp.terraform
haskell.haskell
hbenl.vscode-test-explorer
hediet.vscode-drawio
hoovercj.vscode-power-mode
huacnlee.autocorrect
hyoban.tailwindcss-classname-highlight
intellsmi.comment-translate
JohnnyMorganz.luau-lsp
josee9988.minifyall
kisstkondoros.vscode-gutter-preview
KnisterPeter.vscode-commitizen
LeetCode.vscode-leetcode
LittleFoxTeam.vscode-python-test-adapter
Lokalise.i18n-ally
marp-team.marp-vscode
MarsCode.marscode-extension
marus25.cortex-debug
mechatroner.rainbow-csv
meganrogge.template-string-converter
mikestead.dotenv
mongodb.mongodb-vscode
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-zh-hans
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-dotnettools.vscodeintellicode-csharp
ms-iot.vscode-ros
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.mssql
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.mypy-type-checker
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-account
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.js-debug-nightly
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.PowerShell
ms-vscode.remote-server
ms-vscode.vscode-github-issue-notebooks
ms-vscode.vscode-serial-monitor
ms-vscode.vscode-typescript-next
MS-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
msazurermtools.azurerm-vscode-tools
msjsdiag.vscode-react-native
naumovs.color-highlight
negokaz.live-server-preview
nikhilweee.vsleet
Nuxt.mdc
Nuxtr.nuxtr-vscode
Oracle.oracle-java
Oracle.oracledevtools
oxc.oxc-vscode
PKief.material-icon-theme
platformio.platformio-ide
pomdtr.excalidraw-editor
Postman.postman-for-vscode
Prisma.prisma
puppet.puppet-vscode
rebornix.Ruby
redhat.ansible
redhat.fabric8-analytics
redhat.java
redhat.vscode-yaml
redjue.git-commit-plugin
ritwickdey.LiveServer
rodrigovallades.es7-react-js-snippets
RooVeterinaryInc.roo-cline
rust-lang.rust-analyzer
rvest.vs-code-prettier-eslint
salesforce.salesforcedx-vscode-lwc
saoudrizwan.claude-dev
sdras.vue-vscode-snippets
seunlanlege.action-buttons
shd101wyy.markdown-preview-enhanced
slevesque.shader
sourcegraph.cody-ai
SpecStory.specstory-vscode
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
sumneko.lua
Supabase.vscode-supabase-extension
svelte.svelte-vscode
swellaby.vscode-rust-test-adapter
tamasfe.even-better-toml
tauri-apps.tauri-vscode
tencent-cloud.coding-copilot
think2011.react-i18n
timonwong.shellcheck
tomoki1207.pdf
twxs.cmake
ultram4rine.vscode-choosealicense
unifiedjs.vscode-mdx
unifiedjs.vscode-remark
usernamehw.errorlens
vincaslt.highlight-matching-tag
VisualStudioExptTeam.vscodeintellicode
vitest.explorer
vivaxy.vscode-conventional-commits
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
vscodevim.vim
vsls-contrib.codetour
vsls-contrib.gistfs
vsls-contrib.gitdoc
Vue.volar
Vue.vscode-typescript-vue-plugin
Vxplain.vxplain
waderyan.gitblame
WakaTime.vscode-wakatime
WallabyJs.console-ninja
willasm.comment-highlighter
wmaurer.change-case
yxl.cloudmusic
yy0931.vscode-sqlite3-editor
yzhang.markdown-all-in-one
zhuangtongfa.Material-theme
zhucy.project-tree
